MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F6015/mcu.h
#define LATE LATE
extern volatile uint16_t LATE __attribute__((__sfr__));
typedef struct tagLATEBITS {
  uint16_t LATE0:1;
  uint16_t LATE1:1;
  uint16_t LATE2:1;
  uint16_t LATE3:1;
  uint16_t LATE4:1;
  uint16_t LATE5:1;
  uint16_t LATE6:1;
  uint16_t LATE7:1;
} LATEBITS;
extern volatile LATEBITS LATEbits __attribute__((__sfr__));

#define TRISF TRISF
extern volatile uint16_t TRISF __attribute__((__sfr__));
typedef struct tagTRISFBITS {
  uint16_t TRISF0:1;
  uint16_t TRISF1:1;
  uint16_t TRISF2:1;
  uint16_t TRISF3:1;
  uint16_t TRISF4:1;
  uint16_t TRISF5:1;
  uint16_t TRISF6:1;
} TRISFBITS;
extern volatile TRISFBITS TRISFbits __attribute__((__sfr__));

#define PORTF PORTF
extern volatile uint16_t PORTF __attribute__((__sfr__));
typedef struct tagPORTFBITS {
  uint16_t RF0:1;
  uint16_t RF1:1;
  uint16_t RF2:1;
  uint16_t RF3:1;
  uint16_t RF4:1;
  uint16_t RF5:1;
  uint16_t RF6:1;
} PORTFBITS;
extern volatile PORTFBITS PORTFbits __attribute__((__sfr__));

#define LATF LATF
extern volatile uint16_t LATF __attribute__((__sfr__));
typedef struct tagLATFBITS {
  uint16_t LATF0:1;
  uint16_t LATF1:1;
  uint16_t LATF2:1;
  uint16_t LATF3:1;
  uint16_t LATF4:1;
  uint16_t LATF5:1;
  uint16_t LATF6:1;
} LATFBITS;
extern volatile LATFBITS LATFbits __attribute__((__sfr__));

#define TRISG TRISG
extern volatile uint16_t TRISG __attribute__((__sfr__));
typedef struct tagTRISGBITS {
  uint16_t :2;
  uint16_t TRISG2:1;
  uint16_t TRISG3:1;
  uint16_t :2;
  uint16_t TRISG6:1;
  uint16_t TRISG7:1;
  uint16_t TRISG8:1;
  uint16_t TRISG9:1;
} TRISGBITS;
extern volatile TRISGBITS TRISGbits __attribute__((__sfr__));

#define PORTG PORTG
extern volatile uint16_t PORTG __attribute__((__sfr__));
typedef struct tagPORTGBITS {
  uint16_t :2;
  uint16_t RG2:1;
  uint16_t RG3:1;
  uint16_t :2;
  uint16_t RG6:1;
  uint16_t RG7:1;
  uint16_t RG8:1;
  uint16_t RG9:1;
} PORTGBITS;
extern volatile PORTGBITS PORTGbits __attribute__((__sfr__));

#define LATG LATG
extern volatile uint16_t LATG __attribute__((__sfr__));
typedef struct tagLATGBITS {
  uint16_t :2;
  uint16_t LATG2:1;
  uint16_t LATG3:1;
  uint16_t :2;
  uint16_t LATG6:1;
  uint16_t LATG7:1;
  uint16_t LATG8:1;
  uint16_t LATG9:1;
} LATGBITS;
extern volatile LATGBITS LATGbits __attribute__((__sfr__));


/* Generic structure of entire SFR area for each CAN module */
typedef struct tagCAN {
        uint16_t cxrxf0sid;
        uint16_t cxrxf0eidh;
        uint16_t cxrxf0eidl;
        uint16_t reserved0;
        uint16_t cxrxf1sid;
        uint16_t cxrxf1eidh;
        uint16_t cxrxf1eidl;
        uint16_t reserved1;
        uint16_t cxrxf2sid;
        uint16_t cxrxf2eidh;
        uint16_t cxrxf2eidl;
        uint16_t reserved2;
        uint16_t cxrxf3sid;
        uint16_t cxrxf3eidh;
        uint16_t cxrxf3eidl;
        uint16_t reserved3;
        uint16_t cxrxf4sid;
        uint16_t cxrxf4eidh;
        uint16_t cxrxf4eidl;
        uint16_t reserved4;
        uint16_t cxrxf5sid;
        uint16_t cxrxf5eidh;
        uint16_t cxrxf5eidl;
        uint16_t reserved5;
        uint16_t cxrxm0sid;
        uint16_t cxrxm0eidh;
        uint16_t cxrxm0eidl;
        uint16_t reserved6;
        uint16_t cxrxm1sid;
        uint16_t cxrxm1eidh;
        uint16_t cxrxm1eidl;
        uint16_t reserved7;
        uint16_t cxtx2sid;
        uint16_t cxtx2eid;
        uint16_t cxtx2dlc;
        uint16_t cxtx2b1;
        uint16_t cxtx2b2;
        uint16_t cxtx2b3;
        uint16_t cxtx2b4;
        uint16_t cxtx2con;
        uint16_t cxtx1sid;
        uint16_t cxtx1eid;
        uint16_t cxtx1dlc;
        uint16_t cxtx1b1;
        uint16_t cxtx1b2;
        uint16_t cxtx1b3;
        uint16_t cxtx1b4;
        uint16_t cxtx1con;
        uint16_t cxtx0sid;
        uint16_t cxtx0eid;
        uint16_t cxtx0dlc;
        uint16_t cxtx0b1;
        uint16_t cxtx0b2;
        uint16_t cxtx0b3;
        uint16_t cxtx0b4;
        uint16_t cxtx0con;
        uint16_t cxrx1sid;
        uint16_t cxrx1eid;
        uint16_t cxrx1dlc;
        uint16_t cxrx1b1;
        uint16_t cxrx1b2;
        uint16_t cxrx1b3;
        uint16_t cxrx1b4;
        uint16_t cxrx1con;
        uint16_t cxrx0sid;
        uint16_t cxrx0eid;
        uint16_t cxrx0dlc;
        uint16_t cxrx0b1;
        uint16_t cxrx0b2;
        uint16_t cxrx0b3;
        uint16_t cxrx0b4;
        uint16_t cxrx0con;
        uint16_t cxctrl;
        uint16_t cxcfg1;
        uint16_t cxcfg2;
        uint16_t cxintf;
        uint16_t cxinte;
        uint16_t cxec;
        uint16_t reserved8[50];
} CAN, *PCAN;

/* SFR blocks for each CAN module */
#define CAN1 CAN1
extern volatile CAN CAN1 __attribute__((__sfr__));

#define C1RXF0SID C1RXF0SID
extern volatile uint16_t C1RXF0SID __attribute__((__sfr__));
__extension__ typedef struct tagC1RXF0SIDBITS {
  union {
    struct {
      uint16_t EXIDE:1;
      uint16_t :1;
      uint16_t SID0:1;
      uint16_t SID1:1;
      uint16_t SID2:1;
      uint16_t SID3:1;
      uint16_t SID4:1;
      uint16_t SID5:1;
      uint16_t SID6:1;
      uint16_t SID7:1;
      uint16_t SID8:1;
      uint16_t SID9:1;
      uint16_t SID10:1;
    };
    struct {
      uint16_t :2;
      uint16_t SID:11;
    };
  };
} C1RXF0SIDBITS;
extern volatile C1RXF0SIDBITS C1RXF0SIDbits __attribute__((__sfr__));

#define C1RXF0EIDH C1RXF0EIDH
extern volatile uint16_t C1RXF0EIDH __attribute__((__sfr__));
__extension__ typedef struct tagC1RXF0EIDHBITS {
  union {
    struct {
      uint16_t EID6:1;
      uint16_t EID7:1;
      uint16_t EID8:1;
      uint16_t EID9:1;
      uint16_t EID10:1;
      uint16_t EID11:1;
      uint16_t EID12:1;
      uint16_t EID13:1;
      uint16_t EID14:1;
      uint16_t EID15:1;
      uint16_t EID16:1;
      uint16_t EID17:1;
    };
    struct {
      uint16_t RXEID6:1;
      uint16_t RXEID7:1;
      uint16_t RXEID8:1;
      uint16_t RXEID9:1;
      uint16_t RXEID10:1;
      uint16_t RXEID11:1;
      uint16_t RXEID12:1;
      uint16_t RXEID13:1;
      uint16_t RXEID14:1;
      uint16_t RXEID15:1;
      uint16_t RXEID16:1;
      uint16_t RXEID17:1;
    };
  };
} C1RXF0EIDHBITS;
