MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F6015/mcu.h
/* C1TX2EID */
/* Bitname _EID6 cannot be defined because it is used by more than one SFR */
/* Bitname _EID7 cannot be defined because it is used by more than one SFR */
/* Bitname _EID8 cannot be defined because it is used by more than one SFR */
/* Bitname _EID9 cannot be defined because it is used by more than one SFR */
/* Bitname _EID10 cannot be defined because it is used by more than one SFR */
/* Bitname _EID11 cannot be defined because it is used by more than one SFR */
/* Bitname _EID12 cannot be defined because it is used by more than one SFR */
/* Bitname _EID13 cannot be defined because it is used by more than one SFR */
/* Bitname _EID14 cannot be defined because it is used by more than one SFR */
/* Bitname _EID15 cannot be defined because it is used by more than one SFR */
/* Bitname _EID16 cannot be defined because it is used by more than one SFR */
/* Bitname _EID17 cannot be defined because it is used by more than one SFR */
/* Bitname _EID13_6 cannot be defined because it is used by more than one SFR */
/* Bitname _EID17_14 cannot be defined because it is used by more than one SFR */
/* Bitname _TXEID14 cannot be defined because it is used by more than one SFR */
/* Bitname _TXEID15 cannot be defined because it is used by more than one SFR */
/* Bitname _TXEID16 cannot be defined because it is used by more than one SFR */
/* Bitname _TXEID17 cannot be defined because it is used by more than one SFR */

/* C1TX2DLC */
/* Bitname _DLC cannot be defined because it is used by more than one SFR */
/* Bitname _TXRB0 cannot be defined because it is used by more than one SFR */
/* Bitname _TXRB1 cannot be defined because it is used by more than one SFR */
/* Bitname _TXRTR cannot be defined because it is used by more than one SFR */
/* Bitname _EID0 cannot be defined because it is used by more than one SFR */
/* Bitname _EID1 cannot be defined because it is used by more than one SFR */
/* Bitname _EID2 cannot be defined because it is used by more than one SFR */
/* Bitname _EID3 cannot be defined because it is used by more than one SFR */
/* Bitname _EID4 cannot be defined because it is used by more than one SFR */
/* Bitname _EID5 cannot be defined because it is used by more than one SFR */
/* Bitname _EID5_0 cannot be defined because it is used by more than one SFR */
/* Bitname _DLC0 cannot be defined because it is used by more than one SFR */
/* Bitname _DLC1 cannot be defined because it is used by more than one SFR */
/* Bitname _DLC2 cannot be defined because it is used by more than one SFR */
/* Bitname _DLC3 cannot be defined because it is used by more than one SFR */

/* C1TX2B1 */
#define _TXB2D00 C1TX2B1bits.TXB2D00
#define _TXB2D01 C1TX2B1bits.TXB2D01
#define _TXB2D02 C1TX2B1bits.TXB2D02
#define _TXB2D03 C1TX2B1bits.TXB2D03
#define _TXB2D04 C1TX2B1bits.TXB2D04
#define _TXB2D05 C1TX2B1bits.TXB2D05
#define _TXB2D06 C1TX2B1bits.TXB2D06
#define _TXB2D07 C1TX2B1bits.TXB2D07
#define _TXB2D10 C1TX2B1bits.TXB2D10
#define _TXB2D11 C1TX2B1bits.TXB2D11
#define _TXB2D12 C1TX2B1bits.TXB2D12
#define _TXB2D13 C1TX2B1bits.TXB2D13
#define _TXB2D14 C1TX2B1bits.TXB2D14
#define _TXB2D15 C1TX2B1bits.TXB2D15
#define _TXB2D16 C1TX2B1bits.TXB2D16
#define _TXB2D17 C1TX2B1bits.TXB2D17

/* C1TX2B2 */
#define _TXB2D20 C1TX2B2bits.TXB2D20
#define _TXB2D21 C1TX2B2bits.TXB2D21
#define _TXB2D22 C1TX2B2bits.TXB2D22
#define _TXB2D23 C1TX2B2bits.TXB2D23
#define _TXB2D24 C1TX2B2bits.TXB2D24
#define _TXB2D25 C1TX2B2bits.TXB2D25
#define _TXB2D26 C1TX2B2bits.TXB2D26
#define _TXB2D27 C1TX2B2bits.TXB2D27
#define _TXB2D30 C1TX2B2bits.TXB2D30
#define _TXB2D31 C1TX2B2bits.TXB2D31
#define _TXB2D32 C1TX2B2bits.TXB2D32
#define _TXB2D33 C1TX2B2bits.TXB2D33
#define _TXB2D34 C1TX2B2bits.TXB2D34
#define _TXB2D35 C1TX2B2bits.TXB2D35
#define _TXB2D36 C1TX2B2bits.TXB2D36
#define _TXB2D37 C1TX2B2bits.TXB2D37

/* C1TX2B3 */
#define _TX2B2D40 C1TX2B3bits.TX2B2D40
#define _TX2B2D41 C1TX2B3bits.TX2B2D41
#define _TX2B2D42 C1TX2B3bits.TX2B2D42
#define _TX2B2D43 C1TX2B3bits.TX2B2D43
#define _TX2B2D44 C1TX2B3bits.TX2B2D44
#define _TX2B2D45 C1TX2B3bits.TX2B2D45
#define _TX2B2D46 C1TX2B3bits.TX2B2D46
#define _TX2B2D47 C1TX2B3bits.TX2B2D47
#define _TXB2D50 C1TX2B3bits.TXB2D50
#define _TXB2D51 C1TX2B3bits.TXB2D51
#define _TXB2D52 C1TX2B3bits.TXB2D52
#define _TXB2D53 C1TX2B3bits.TXB2D53
#define _TXB2D54 C1TX2B3bits.TXB2D54
#define _TXB2D55 C1TX2B3bits.TXB2D55
#define _TXB2D56 C1TX2B3bits.TXB2D56
#define _TXB2D57 C1TX2B3bits.TXB2D57

/* C1TX2B4 */
#define _TX2B2D60 C1TX2B4bits.TX2B2D60
#define _TX2B2D61 C1TX2B4bits.TX2B2D61
#define _TX2B2D62 C1TX2B4bits.TX2B2D62
#define _TX2B2D63 C1TX2B4bits.TX2B2D63
#define _TX2B2D64 C1TX2B4bits.TX2B2D64
#define _TX2B2D65 C1TX2B4bits.TX2B2D65
#define _TX2B2D66 C1TX2B4bits.TX2B2D66
#define _TX2B2D67 C1TX2B4bits.TX2B2D67
#define _TX2B2D70 C1TX2B4bits.TX2B2D70
#define _TX2B2D71 C1TX2B4bits.TX2B2D71
#define _TX2B2D72 C1TX2B4bits.TX2B2D72
#define _TX2B2D73 C1TX2B4bits.TX2B2D73
#define _TX2B2D74 C1TX2B4bits.TX2B2D74
#define _TX2B2D75 C1TX2B4bits.TX2B2D75
#define _TX2B2D76 C1TX2B4bits.TX2B2D76
#define _TX2B2D77 C1TX2B4bits.TX2B2D77

/* C1TX2CON */
/* Bitname _TXPRI cannot be defined because it is used by more than one SFR */
/* Bitname _TXREQ cannot be defined because it is used by more than one SFR */
/* Bitname _TXERR cannot be defined because it is used by more than one SFR */
/* Bitname _TXLARB cannot be defined because it is used by more than one SFR */
/* Bitname _TXABT cannot be defined because it is used by more than one SFR */
/* Bitname _TXPRI0 cannot be defined because it is used by more than one SFR */
/* Bitname _TXPRI1 cannot be defined because it is used by more than one SFR */

/* C1TX1SID */
/* Bitname _TXIDE cannot be defined because it is used by more than one SFR */
/* Bitname _SRR cannot be defined because it is used by more than one SFR */
/* Bitname _SID0 cannot be defined because it is used by more than one SFR */
/* Bitname _SID1 cannot be defined because it is used by more than one SFR */
/* Bitname _SID2 cannot be defined because it is used by more than one SFR */
/* Bitname _SID3 cannot be defined because it is used by more than one SFR */
/* Bitname _SID4 cannot be defined because it is used by more than one SFR */
/* Bitname _SID5 cannot be defined because it is used by more than one SFR */
/* Bitname _SID6 cannot be defined because it is used by more than one SFR */
/* Bitname _SID7 cannot be defined because it is used by more than one SFR */
/* Bitname _SID8 cannot be defined because it is used by more than one SFR */
/* Bitname _SID9 cannot be defined because it is used by more than one SFR */
/* Bitname _SID10 cannot be defined because it is used by more than one SFR */
/* Bitname _SID5_0 cannot be defined because it is used by more than one SFR */
/* Bitname _SID10_6 cannot be defined because it is used by more than one SFR */

/* C1TX1EID */
/* Bitname _EID6 cannot be defined because it is used by more than one SFR */
/* Bitname _EID7 cannot be defined because it is used by more than one SFR */
/* Bitname _EID8 cannot be defined because it is used by more than one SFR */
/* Bitname _EID9 cannot be defined because it is used by more than one SFR */
/* Bitname _EID10 cannot be defined because it is used by more than one SFR */
/* Bitname _EID11 cannot be defined because it is used by more than one SFR */
/* Bitname _EID12 cannot be defined because it is used by more than one SFR */
/* Bitname _EID13 cannot be defined because it is used by more than one SFR */
/* Bitname _EID14 cannot be defined because it is used by more than one SFR */
/* Bitname _EID15 cannot be defined because it is used by more than one SFR */
/* Bitname _EID16 cannot be defined because it is used by more than one SFR */
/* Bitname _EID17 cannot be defined because it is used by more than one SFR */
/* Bitname _EID13_6 cannot be defined because it is used by more than one SFR */
/* Bitname _EID17_14 cannot be defined because it is used by more than one SFR */
/* Bitname _TXEID14 cannot be defined because it is used by more than one SFR */
/* Bitname _TXEID15 cannot be defined because it is used by more than one SFR */
/* Bitname _TXEID16 cannot be defined because it is used by more than one SFR */
/* Bitname _TXEID17 cannot be defined because it is used by more than one SFR */

/* C1TX1DLC */
/* Bitname _DLC cannot be defined because it is used by more than one SFR */
/* Bitname _TXRB0 cannot be defined because it is used by more than one SFR */
/* Bitname _TXRB1 cannot be defined because it is used by more than one SFR */
/* Bitname _TXRTR cannot be defined because it is used by more than one SFR */
/* Bitname _EID0 cannot be defined because it is used by more than one SFR */
/* Bitname _EID1 cannot be defined because it is used by more than one SFR */
/* Bitname _EID2 cannot be defined because it is used by more than one SFR */
/* Bitname _EID3 cannot be defined because it is used by more than one SFR */
/* Bitname _EID4 cannot be defined because it is used by more than one SFR */
/* Bitname _EID5 cannot be defined because it is used by more than one SFR */
/* Bitname _EID5_0 cannot be defined because it is used by more than one SFR */
/* Bitname _DLC0 cannot be defined because it is used by more than one SFR */
/* Bitname _DLC1 cannot be defined because it is used by more than one SFR */
/* Bitname _DLC2 cannot be defined because it is used by more than one SFR */
/* Bitname _DLC3 cannot be defined because it is used by more than one SFR */
#define _TXDLC0 C1TX1DLCbits.TXDLC0
#define _TXDLC1 C1TX1DLCbits.TXDLC1
#define _TXDLC2 C1TX1DLCbits.TXDLC2
#define _TXDLC3 C1TX1DLCbits.TXDLC3

/* C1TX1B1 */
/* Bitname _TXB1D00 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB1D01 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB1D02 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB1D03 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB1D04 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB1D05 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB1D06 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB1D07 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB1D10 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB1D11 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB1D12 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB1D13 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB1D14 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB1D15 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB1D16 cannot be defined because it is used by more than one SFR */
/* Bitname _TXB1D17 cannot be defined because it is used by more than one SFR */

