MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F6015/mcu.h
#define _C1RXM0EIDH_EID14_POSITION               0x00000008
#define _C1RXM0EIDH_EID14_MASK                   0x00000100
#define _C1RXM0EIDH_EID14_LENGTH                 0x00000001

#define _C1RXM0EIDH_EID15_POSITION               0x00000009
#define _C1RXM0EIDH_EID15_MASK                   0x00000200
#define _C1RXM0EIDH_EID15_LENGTH                 0x00000001

#define _C1RXM0EIDH_EID16_POSITION               0x0000000A
#define _C1RXM0EIDH_EID16_MASK                   0x00000400
#define _C1RXM0EIDH_EID16_LENGTH                 0x00000001

#define _C1RXM0EIDH_EID17_POSITION               0x0000000B
#define _C1RXM0EIDH_EID17_MASK                   0x00000800
#define _C1RXM0EIDH_EID17_LENGTH                 0x00000001

#define _C1RXM0EIDH_RXEID6_POSITION              0x00000000
#define _C1RXM0EIDH_RXEID6_MASK                  0x00000001
#define _C1RXM0EIDH_RXEID6_LENGTH                0x00000001

#define _C1RXM0EIDH_RXEID7_POSITION              0x00000001
#define _C1RXM0EIDH_RXEID7_MASK                  0x00000002
#define _C1RXM0EIDH_RXEID7_LENGTH                0x00000001

#define _C1RXM0EIDH_RXEID8_POSITION              0x00000002
#define _C1RXM0EIDH_RXEID8_MASK                  0x00000004
#define _C1RXM0EIDH_RXEID8_LENGTH                0x00000001

#define _C1RXM0EIDH_RXEID9_POSITION              0x00000003
#define _C1RXM0EIDH_RXEID9_MASK                  0x00000008
#define _C1RXM0EIDH_RXEID9_LENGTH                0x00000001

#define _C1RXM0EIDH_RXEID10_POSITION             0x00000004
#define _C1RXM0EIDH_RXEID10_MASK                 0x00000010
#define _C1RXM0EIDH_RXEID10_LENGTH               0x00000001

#define _C1RXM0EIDH_RXEID11_POSITION             0x00000005
#define _C1RXM0EIDH_RXEID11_MASK                 0x00000020
#define _C1RXM0EIDH_RXEID11_LENGTH               0x00000001

#define _C1RXM0EIDH_RXEID12_POSITION             0x00000006
#define _C1RXM0EIDH_RXEID12_MASK                 0x00000040
#define _C1RXM0EIDH_RXEID12_LENGTH               0x00000001

#define _C1RXM0EIDH_RXEID13_POSITION             0x00000007
#define _C1RXM0EIDH_RXEID13_MASK                 0x00000080
#define _C1RXM0EIDH_RXEID13_LENGTH               0x00000001

#define _C1RXM0EIDH_RXEID14_POSITION             0x00000008
#define _C1RXM0EIDH_RXEID14_MASK                 0x00000100
#define _C1RXM0EIDH_RXEID14_LENGTH               0x00000001

#define _C1RXM0EIDH_RXEID15_POSITION             0x00000009
#define _C1RXM0EIDH_RXEID15_MASK                 0x00000200
#define _C1RXM0EIDH_RXEID15_LENGTH               0x00000001

#define _C1RXM0EIDH_RXEID16_POSITION             0x0000000A
#define _C1RXM0EIDH_RXEID16_MASK                 0x00000400
#define _C1RXM0EIDH_RXEID16_LENGTH               0x00000001

#define _C1RXM0EIDH_RXEID17_POSITION             0x0000000B
#define _C1RXM0EIDH_RXEID17_MASK                 0x00000800
#define _C1RXM0EIDH_RXEID17_LENGTH               0x00000001

#define _C1RXM0EIDL_EID0_POSITION                0x0000000A
#define _C1RXM0EIDL_EID0_MASK                    0x00000400
#define _C1RXM0EIDL_EID0_LENGTH                  0x00000001

#define _C1RXM0EIDL_EID1_POSITION                0x0000000B
#define _C1RXM0EIDL_EID1_MASK                    0x00000800
#define _C1RXM0EIDL_EID1_LENGTH                  0x00000001

#define _C1RXM0EIDL_EID2_POSITION                0x0000000C
#define _C1RXM0EIDL_EID2_MASK                    0x00001000
#define _C1RXM0EIDL_EID2_LENGTH                  0x00000001

#define _C1RXM0EIDL_EID3_POSITION                0x0000000D
#define _C1RXM0EIDL_EID3_MASK                    0x00002000
#define _C1RXM0EIDL_EID3_LENGTH                  0x00000001

#define _C1RXM0EIDL_EID4_POSITION                0x0000000E
#define _C1RXM0EIDL_EID4_MASK                    0x00004000
#define _C1RXM0EIDL_EID4_LENGTH                  0x00000001

#define _C1RXM0EIDL_EID5_POSITION                0x0000000F
#define _C1RXM0EIDL_EID5_MASK                    0x00008000
#define _C1RXM0EIDL_EID5_LENGTH                  0x00000001

#define _C1RXM0EIDL_EID5_0_POSITION              0x0000000A
#define _C1RXM0EIDL_EID5_0_MASK                  0x0000FC00
#define _C1RXM0EIDL_EID5_0_LENGTH                0x00000006

#define _C1RXM0EIDL_RXEID0_POSITION              0x0000000A
#define _C1RXM0EIDL_RXEID0_MASK                  0x00000400
#define _C1RXM0EIDL_RXEID0_LENGTH                0x00000001

#define _C1RXM0EIDL_RXEID1_POSITION              0x0000000B
#define _C1RXM0EIDL_RXEID1_MASK                  0x00000800
#define _C1RXM0EIDL_RXEID1_LENGTH                0x00000001

#define _C1RXM0EIDL_RXEID2_POSITION              0x0000000C
#define _C1RXM0EIDL_RXEID2_MASK                  0x00001000
#define _C1RXM0EIDL_RXEID2_LENGTH                0x00000001

#define _C1RXM0EIDL_RXEID3_POSITION              0x0000000D
#define _C1RXM0EIDL_RXEID3_MASK                  0x00002000
#define _C1RXM0EIDL_RXEID3_LENGTH                0x00000001

#define _C1RXM0EIDL_RXEID4_POSITION              0x0000000E
#define _C1RXM0EIDL_RXEID4_MASK                  0x00004000
#define _C1RXM0EIDL_RXEID4_LENGTH                0x00000001

#define _C1RXM0EIDL_RXEID5_POSITION              0x0000000F
#define _C1RXM0EIDL_RXEID5_MASK                  0x00008000
#define _C1RXM0EIDL_RXEID5_LENGTH                0x00000001

#define _C1RXM1SID_MIDE_POSITION                 0x00000000
#define _C1RXM1SID_MIDE_MASK                     0x00000001
#define _C1RXM1SID_MIDE_LENGTH                   0x00000001

#define _C1RXM1SID_SID0_POSITION                 0x00000002
#define _C1RXM1SID_SID0_MASK                     0x00000004
#define _C1RXM1SID_SID0_LENGTH                   0x00000001

#define _C1RXM1SID_SID1_POSITION                 0x00000003
#define _C1RXM1SID_SID1_MASK                     0x00000008
#define _C1RXM1SID_SID1_LENGTH                   0x00000001

#define _C1RXM1SID_SID2_POSITION                 0x00000004
#define _C1RXM1SID_SID2_MASK                     0x00000010
#define _C1RXM1SID_SID2_LENGTH                   0x00000001

#define _C1RXM1SID_SID3_POSITION                 0x00000005
#define _C1RXM1SID_SID3_MASK                     0x00000020
#define _C1RXM1SID_SID3_LENGTH                   0x00000001

#define _C1RXM1SID_SID4_POSITION                 0x00000006
#define _C1RXM1SID_SID4_MASK                     0x00000040
#define _C1RXM1SID_SID4_LENGTH                   0x00000001

