MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F6015/mcu.h
#define _C1RXM1SID_SID5_POSITION                 0x00000007
#define _C1RXM1SID_SID5_MASK                     0x00000080
#define _C1RXM1SID_SID5_LENGTH                   0x00000001

#define _C1RXM1SID_SID6_POSITION                 0x00000008
#define _C1RXM1SID_SID6_MASK                     0x00000100
#define _C1RXM1SID_SID6_LENGTH                   0x00000001

#define _C1RXM1SID_SID7_POSITION                 0x00000009
#define _C1RXM1SID_SID7_MASK                     0x00000200
#define _C1RXM1SID_SID7_LENGTH                   0x00000001

#define _C1RXM1SID_SID8_POSITION                 0x0000000A
#define _C1RXM1SID_SID8_MASK                     0x00000400
#define _C1RXM1SID_SID8_LENGTH                   0x00000001

#define _C1RXM1SID_SID9_POSITION                 0x0000000B
#define _C1RXM1SID_SID9_MASK                     0x00000800
#define _C1RXM1SID_SID9_LENGTH                   0x00000001

#define _C1RXM1SID_SID10_POSITION                0x0000000C
#define _C1RXM1SID_SID10_MASK                    0x00001000
#define _C1RXM1SID_SID10_LENGTH                  0x00000001

#define _C1RXM1SID_SID_POSITION                  0x00000002
#define _C1RXM1SID_SID_MASK                      0x00001FFC
#define _C1RXM1SID_SID_LENGTH                    0x0000000B

#define _C1RXM1EIDH_EID6_POSITION                0x00000000
#define _C1RXM1EIDH_EID6_MASK                    0x00000001
#define _C1RXM1EIDH_EID6_LENGTH                  0x00000001

#define _C1RXM1EIDH_EID7_POSITION                0x00000001
#define _C1RXM1EIDH_EID7_MASK                    0x00000002
#define _C1RXM1EIDH_EID7_LENGTH                  0x00000001

#define _C1RXM1EIDH_EID8_POSITION                0x00000002
#define _C1RXM1EIDH_EID8_MASK                    0x00000004
#define _C1RXM1EIDH_EID8_LENGTH                  0x00000001

#define _C1RXM1EIDH_EID9_POSITION                0x00000003
#define _C1RXM1EIDH_EID9_MASK                    0x00000008
#define _C1RXM1EIDH_EID9_LENGTH                  0x00000001

#define _C1RXM1EIDH_EID10_POSITION               0x00000004
#define _C1RXM1EIDH_EID10_MASK                   0x00000010
#define _C1RXM1EIDH_EID10_LENGTH                 0x00000001

#define _C1RXM1EIDH_EID11_POSITION               0x00000005
#define _C1RXM1EIDH_EID11_MASK                   0x00000020
#define _C1RXM1EIDH_EID11_LENGTH                 0x00000001

#define _C1RXM1EIDH_EID12_POSITION               0x00000006
#define _C1RXM1EIDH_EID12_MASK                   0x00000040
#define _C1RXM1EIDH_EID12_LENGTH                 0x00000001

#define _C1RXM1EIDH_EID13_POSITION               0x00000007
#define _C1RXM1EIDH_EID13_MASK                   0x00000080
#define _C1RXM1EIDH_EID13_LENGTH                 0x00000001

#define _C1RXM1EIDH_EID14_POSITION               0x00000008
#define _C1RXM1EIDH_EID14_MASK                   0x00000100
#define _C1RXM1EIDH_EID14_LENGTH                 0x00000001

#define _C1RXM1EIDH_EID15_POSITION               0x00000009
#define _C1RXM1EIDH_EID15_MASK                   0x00000200
#define _C1RXM1EIDH_EID15_LENGTH                 0x00000001

#define _C1RXM1EIDH_EID16_POSITION               0x0000000A
#define _C1RXM1EIDH_EID16_MASK                   0x00000400
#define _C1RXM1EIDH_EID16_LENGTH                 0x00000001

#define _C1RXM1EIDH_EID17_POSITION               0x0000000B
#define _C1RXM1EIDH_EID17_MASK                   0x00000800
#define _C1RXM1EIDH_EID17_LENGTH                 0x00000001

#define _C1RXM1EIDH_RXEID6_POSITION              0x00000000
#define _C1RXM1EIDH_RXEID6_MASK                  0x00000001
#define _C1RXM1EIDH_RXEID6_LENGTH                0x00000001

#define _C1RXM1EIDH_RXEID7_POSITION              0x00000001
#define _C1RXM1EIDH_RXEID7_MASK                  0x00000002
#define _C1RXM1EIDH_RXEID7_LENGTH                0x00000001

#define _C1RXM1EIDH_RXEID8_POSITION              0x00000002
#define _C1RXM1EIDH_RXEID8_MASK                  0x00000004
#define _C1RXM1EIDH_RXEID8_LENGTH                0x00000001

#define _C1RXM1EIDH_RXEID9_POSITION              0x00000003
#define _C1RXM1EIDH_RXEID9_MASK                  0x00000008
#define _C1RXM1EIDH_RXEID9_LENGTH                0x00000001

#define _C1RXM1EIDH_RXEID10_POSITION             0x00000004
#define _C1RXM1EIDH_RXEID10_MASK                 0x00000010
#define _C1RXM1EIDH_RXEID10_LENGTH               0x00000001

#define _C1RXM1EIDH_RXEID11_POSITION             0x00000005
#define _C1RXM1EIDH_RXEID11_MASK                 0x00000020
#define _C1RXM1EIDH_RXEID11_LENGTH               0x00000001

#define _C1RXM1EIDH_RXEID12_POSITION             0x00000006
#define _C1RXM1EIDH_RXEID12_MASK                 0x00000040
#define _C1RXM1EIDH_RXEID12_LENGTH               0x00000001

#define _C1RXM1EIDH_RXEID13_POSITION             0x00000007
#define _C1RXM1EIDH_RXEID13_MASK                 0x00000080
#define _C1RXM1EIDH_RXEID13_LENGTH               0x00000001

#define _C1RXM1EIDH_RXEID14_POSITION             0x00000008
#define _C1RXM1EIDH_RXEID14_MASK                 0x00000100
#define _C1RXM1EIDH_RXEID14_LENGTH               0x00000001

#define _C1RXM1EIDH_RXEID15_POSITION             0x00000009
#define _C1RXM1EIDH_RXEID15_MASK                 0x00000200
#define _C1RXM1EIDH_RXEID15_LENGTH               0x00000001

#define _C1RXM1EIDH_RXEID16_POSITION             0x0000000A
#define _C1RXM1EIDH_RXEID16_MASK                 0x00000400
#define _C1RXM1EIDH_RXEID16_LENGTH               0x00000001

#define _C1RXM1EIDH_RXEID17_POSITION             0x0000000B
#define _C1RXM1EIDH_RXEID17_MASK                 0x00000800
#define _C1RXM1EIDH_RXEID17_LENGTH               0x00000001

#define _C1RXM1EIDL_EID0_POSITION                0x0000000A
#define _C1RXM1EIDL_EID0_MASK                    0x00000400
#define _C1RXM1EIDL_EID0_LENGTH                  0x00000001

#define _C1RXM1EIDL_EID1_POSITION                0x0000000B
#define _C1RXM1EIDL_EID1_MASK                    0x00000800
#define _C1RXM1EIDL_EID1_LENGTH                  0x00000001

#define _C1RXM1EIDL_EID2_POSITION                0x0000000C
#define _C1RXM1EIDL_EID2_MASK                    0x00001000
#define _C1RXM1EIDL_EID2_LENGTH                  0x00000001

